//游泳比赛，预测比赛结果
//A说：B第二，我第三
//B说:我第二，E第四
//C说：我第一，D第二
//D说：C最后，我第三
//E说：我第四，A第一
//每位选手都说对了一半，请用编程确定比赛的名次
#include<stdio.h>
int main()
{
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	for (a = 0; a <= 5; a++)
	{
		for (b = 0; b <= 5; b++)
		{
			for (c = 0; c <= 5; c++)
			{
				for (d = 0; d <= 5; d++)
				{
					for (e = 0; e <= 5; e++)
					{
						if (((b==2)+(a==3)==1) &&
						   ((b==2) + (e==4) == 1) &&
						   ((c==1) + (d==2) == 1) &&
							((c==5) + (d==3) == 1) &&
							((e==4) + (a==1) == 1))
						{
						if (a * b * c * d * e == 120)
						{
							printf("a=%d,b=%d,c=%d,d=%d,e=%d\n", a, b, c, d, e);
						}
						

					
					    }
					}
				}
			}
		}
	}
	return 0;
}
